// Задача 8:    
// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

Console.WriteLine("Введите число");
int N = int.Parse(Console.ReadLine());
if(N % 2 == 0){
    Console.WriteLine("Ваше число чётное");
}
else{
    Console.WriteLine("Ваше число не чётное");
}